Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: Pre-Op: Issues an NMT Pre-Op command for this module.
it_it: Pre-Op: Emette un comando NMT Pre-Op per questo modulo.

source: Precautions
it_it: Precauzioni

source: Preparation
it_it: Preparazione

source: Press and hold to power on for program flashing
it_it: Tenere premuto per accendere il programma e farlo lampeggiare

source: Press the ENTER key on the keyboard to send the new value to the module.
it_it: Premere il tasto ENTER sulla tastiera per inviare il nuovo valore al modulo.

source: Press the ENTER key to send the new value to the chip.
it_it: Premere il tasto ENTER per inviare il nuovo valore al chip.

source: Press the Windows + R keys to open the "Run" dialog box, input devmgmt.msc and press Enter to open the Device Manager; Expand the "Port (COM and LPT)" section, here it will list all the COM ports and their current status.
it_it: Premere i tasti Windows + R per aprire la finestra di dialogo "Run", inserire devmgmt.msc e premere Enter per aprire Device Manager; espandere la sezione "Port (COM and LPT)", dove verranno elencate tutte le porte COM e il loro stato attuale.

source: Press the return key to send the new value to the module.
it_it: Premere il tasto "return" per inviare il nuovo valore al modulo.

source: Press to restart controller
it_it: Premere per riavviare il controller

source: Print corresponding log information based on different alarm types triggered, including error passive alarms, bus error alarms, and receive queue overflow alarms, and print related status information
it_it: Stampa le informazioni di log corrispondenti in base ai diversi tipi di allarme attivati, inclusi allarmi passivi di errore, allarmi di errore del bus e allarmi di overflow della coda di ricezione, e stampa le relative informazioni di stato.

source: Print the corresponding log information according to different alarm types, including passive error alarms, bus error alarms, transmission failure alarms, and transmission success alarms, and print relevant status information
it_it: Stampa le informazioni dei log corrispondenti in base ai diversi tipi di allarme, inclusi allarmi di errore passivo, allarmi di errore bus, allarmi di errore di trasmissione e allarmi di trasmissione riuscita, e stampa le relative informazioni dello stato.

source: Print: print the content of the currently open editor tab.
it_it: Print: stampa il contenuto della scheda dell'editor attualmente aperta.

source: Pro-gram execution can be continued either by the Run/Continue function, the Animate function or the Step function.
it_it: L'esecuzione del programma può proseguire tramite la funzione Run/Continue, la funzione Animate o la funzione Step.

source: Processor
it_it: Processore

source: Producer Information
it_it: Informazioni del Produttore

source: Product Type
it_it: Tipo di Prodotto

source: Product size (L×W)
it_it: Dimensioni del prodotto (L×W)

source: Program execution can be continued by clicking Run/Continue, Animate or Step again.
it_it: L'esecuzione del programma può essere ripresa cliccando nuovamente su Run/Continue, Animate o Step.

source: Program the demo to STM 32F4 using Openocd.
it_it: Programmare la demo su STM 32F4 utilizzando OpenOCD.

source: Project Diagram
it_it: Diagramma del Progetto

source: Pull down to USB mode, otherwise CAN mode
it_it: Pull down in modalità USB, altrimenti in modalità CAN

source: Pull up to CAN mode, otherwise USB mode
it_it: Pull-up in modalità CAN, altrimenti in modalità USB

source: Python IDLE Environment Building
it_it: Creazione dell'Ambiente Python IDLE

source: Query the current identified device number (connect the Raspberry Pi and USB TO UART/I2C/SPI/JTAG, query the device).
it_it: Interrogare il numero del dispositivo attualmente identificato (collegare il Raspberry Pi e l'USB a UART/I2C/SPI/JTAG, interrogare il dispositivo).

source: Query the current identified device number:
it_it: Interrogare il numero di dispositivo attualmente identificato:

source: Question: ESP32-S3-Touch-LCD-4.3 flashing Arduino's RGB screen program fails to compile and reports error?
it_it: Domanda: Il programma di flashing dello schermo RGB di Arduino ESP32-S3-Touch-LCD-4.3 non riesce a compilare e segnala un errore?

source: Question: ESP32-S3-Touch-LCD-4.3 shows no response after flashing an Arduino demo for RGB screen displaying?
it_it: Domanda: L'ESP32-S3-Touch-LCD-4.3 non risponde dopo aver flashato una demo Arduino per la visualizzazione dello schermo RGB?

source: Question: How to check the COM port?
it_it: Domanda: Come controllare la porta COM?

source: Question: How to deal with the first compilation of the program being extremely slow?
it_it: Domanda: Come risolvere il problema della lenta compilazione iniziale del programma?

source: Question: How to solve the problem that the program is flashed successfully but there is no display on LCD?
it_it: Domanda: Come risolvere il problema per cui il programma viene flashato correttamente ma non viene visualizzato nulla sul display LCD?

source: Question: How to use SquareLine Studio to design interfaces?
it_it: Domanda: Come utilizzare SquareLine Studio per progettare interfacce?

source: Question: What should I do if ESP-IDF flashing fails?
it_it: Domanda: Cosa devo fare se il flashing dell'ESP-IDF non riesce?

source: Question: What should I do if I can't find the AppData folder?
it_it: Domanda: Cosa devo fare se non riesco a trovare la cartella AppData?

source: Question: When sending data containing hundreds of numbers, there are breaks between the numbers
it_it: Domanda: Quando si inviano dati contenenti centinaia di numeri, si verificano delle interruzioni tra i numeri

source: Question: Why are all libraries installed, and the flashing LVGL program reports an error missing lv_cong.h?
it_it: Domanda: Perché sono installate tutte le librerie e il programma di flashing LVGL segnala un errore di lv_cong.h mancante?

source: Question: Why did ESP32-S3-Touch-LCD-4.3 CAN reception fail?
it_it: Domanda: Perché la ricezione CAN dell'ESP32-S3-Touch-LCD-4.3 non funziona?

source: Question: Why does error "fatal error:esp_ memory_ utils.h:No such file or directory" occur when compiling demos using the Arduino IDE?
it_it: Domanda: Perché si verifica l'errore "fatal error: esp_ memory_ utils.h: No such file or directory" durante la compilazione di demo utilizzando l'IDE Arduino?

source: Question: Why does the program flashing fail when using a MAC device?
it_it: Domanda: Perché il flashing del programma non riesce quando si utilizza un dispositivo MAC?

source: Question: Why does the screen not display after successful flashing with Arduino?
it_it: Domanda: Perché lo schermo non viene visualizzato dopo aver flashato correttamente con Arduino?

source: Question:3V3 communication succeeds while 5V communication fails?
it_it: Domanda: La comunicazione 3V3 riesce mentre la comunicazione 5V fallisce?

source: Question:Can CAN communication use debugging tools to send continuous frames?
it_it: Domanda: La comunicazione CAN può utilizzare strumenti di debug per inviare frame continui?

source: Question:How to read I2C data using USB TO UART/I2C/SPI/JTAG?
it_it: Domanda: Come leggere i dati I2C utilizzando "USB TO UART/I2C/SPI/JTAG"?

source: Question:Mode switching has no effect?
it_it: Domanda: Il cambio di modalità non ha alcun effetto?

source: Question:Temperature data is -255 or distance data is 65535 when using the I2C debugging example?
it_it: Domanda: I dati di temperatura sono -255 o i dati di distanza sono 65535 quando si utilizza l'esempio di debug I2C?

source: Question:The example runs with a missing PIL library as follows:
it_it: Domanda: L'esempio funziona con una libreria PIL mancante come segue:

source: Question:Unstable sending and receiving of data during communication?
it_it: Domanda: Invio e ricezione dati instabili durante la comunicazione?

source: R: parameter is readable
it_it: R: il parametro è leggibile

source: RCLA <index>, <bank>: copies the contents of the local variable specified by <index> and <bank> to the local accumulator.
it_it: RCLA <index>, <bank>: copia il contenuto della variabile locale specificata da <index> e <bank> nell'accumulatore locale.

source: RCLX <index>, <bank>: copies the contents of the local variable specified by <index> and <bank> to the local X register.
it_it: RCLX <index>, <bank>: copia il contenuto della variabile locale specificata da <index> e <bank> nel registro X locale.

source: RDRV <register>, <upper>, <module index>: read from a motor driver register.
it_it: RDRV <register>, <upper>, <module index>: lettura da un registro del driver motore.

source: RESET button
it_it: Pulsante RESET

source: RMC <register>, <upper>, <module index>: read from a motion controller register.
it_it: RMC <register>, <upper>, <module index>: lettura da un registro del controller di movimento.

source: RS485 interface: The development board is equipped with an RS485 interface, allowing direct connection for device communication, with automatic switching of the circuit's transmit and receive modes
it_it: RS485 interface: La scheda di sviluppo è dotata di un'interfaccia RS485, che consente la connessione diretta per la comunicazione con il dispositivo, con commutazione automatica delle modalità di trasmissione e ricezione del circuito.

source: RS485 terminal
it_it: Terminale RS485

source: RS485 terminal resistor selection interface
it_it: Interfaccia di selezione della resistenza terminale RS485

source: RS485 transceiver chip
it_it: Chip transceiver RS485

source: Random chopper off time: Switches between fixed chopper off time and random chopper off time.
it_it: Random chopper off time: Alterna tra tempo di disattivazione fisso del chopper e tempo di disattivazione casuale.

source: Read / Write: Here you can choose if the datagram shall be sent in read mode or in write mode, i.e. if the read/write bit shall be set or not set.
it_it: Read / Write: Qui è possibile scegliere se il datagramma deve essere inviato in modalità di lettura o in modalità di scrittura, ovvero se il bit di lettura/scrittura deve essere impostato o meno.

source: Read all registers at once.
it_it: Leggere tutti i registri contemporaneamente.

source: Read the triggered alerts by calling twai_read_alerts and obtain the TWAI status information into a twai_status_info_t structure.
it_it: Legge gli allarmi attivati ​​chiamando twai_read_alerts e ottiene le informazioni sullo stato TWAI in una struttura twai_status_info_t.

source: Read triggered alerts and get TWAI status information
it_it: Legge gli "alert" attivati ​​e ottien informazioni sullo stato TWAI.

source: Read value: Shows the contents of the register if this register is readable.
it_it: Read value: Mostra il contenuto del registro se questo è leggibile.

source: Reconnect the device with the computer.
it_it: Ricollegare il dispositivo al computer.

source: Red 5th place
it_it: Rosso 5° posto

source: Red 6th place
it_it: Rosso 6° posto

source: Red 7th place
it_it: Rosso 7° posto

source: Red data 3rd place
it_it: Rosso dati 3° posto

source: Red data 4th place
it_it: Rosso dati 4° posto

source: Red: The red color means that there is high vibration at that velocity.
it_it: Rosso: Il colore rosso significa che a quella velocità si verificano vibrazioni elevate.

source: Redistribution of sources or derived formats (for example, Portable Document Format or Hypertext Markup Language) must retain the above copyright notice, and the complete data sheet, user manual, and documentation of this product including associated application notes; and a reference to other available product-related documentation.
it_it: La ridistribuzione di fonti o formati derivati ​​(ad esempio, Portable Document Format o Hypertext Markup Language) deve contenere la suddetta nota di copyright, nonché la scheda tecnica completa, il manuale utente e la documentazione di questo prodotto, incluse le note applicative associate; e un riferimento ad altra documentazione disponibile relativa al prodotto.

source: Refer to IDF Component Manager for more learning links
it_it: Fare riferimento a Gestore Componenti IDF per ulteriori link

source: Reference link: OLED related resource Reference example is the file under "../OLED_Module_Code /RaspberryPi/python".
it_it: Link di riferimento: risorsa relativa all'OLED L'esempio di riferimento è il file in "../OLED_Module_Code /RaspberryPi/python".

source: Regarding ESP32-related motherboards used with the Arduino IDE, the esp32 by Espressif Systems library must be installed first.
it_it: Per quanto riguarda le schede madri ESP32 utilizzate con l'IDE Arduino, è necessario installare prima la libreria esp32 di Espressif Systems.

source: Register List
it_it: Elenco dei Registri

source: Relative to: Depending on the module and its firmware version it is possible to select the base used for a relative move.
it_it: Relative to: A seconda del modulo e della versione del firmware, è possibile selezionare la base utilizzata per uno spostamento relativo.

source: Relative: Click here to use the given target position as a relative offset to the actual position.
it_it: Relative: Cliccare qui per utilizzare la posizione di destinazione specificata come offset relativo rispetto alla posizione attuale.

source: Remove all Breakpoints: This function removes all currently set breakpoints from the program.
it_it: Remove all Breakpoints: Questa funzione rimuove tutti i breakpoint attualmente impostati dal programma.

source: Remove device: Removes the currently selected device from the list.
it_it: Remove device: Rimuove il dispositivo attualmente selezionato dall'elenco.

source: Remove the check for "DTR" on the serial port debugging assistant
it_it: Rimuovere la spunta per "DTR" nell'assistente di debug della porta seriale.

source: Reply ID: The reply ID of the connected modules.
it_it: Reply ID: L'ID di risposta dei moduli connessi.

source: Reply: Most chips send a reply datagram via SPI.
it_it: Reply: La maggior parte dei chip invia un datagramma di risposta tramite SPI.

source: Request: Enter the datagram that you would like to send in hexadecimal form here.
it_it: Request: Inserire qui il datagramma che si desidera inviare in formato esadecimale.

source: Reset Appl: Issues an NMT Reset Application command for all modules connected to the bus.
it_it: Reset Appl: Invia un comando NMT Reset Application per tutti i moduli connessi al bus.

source: Reset Appl: Issues an NMT Reset Application command for this module.
it_it: Reset Appl: Emette un comando NMT Reset Application per questo modulo.

source: Reset Comm: Issues an NMT Reset Communication command for all modules connected to the bus.
it_it: Reset Comm: nvia un comando NMT Reset Communication per tutti i moduli connessi al bus.

source: Reset Comm: Issues an NMT Reset Communication command for this module.
it_it: Reset Comm: Emette un comando NMT Reset Communication per questo modulo.

source: Reset Stall: with some modules it is necessary to click this button to be able to re-start the motor after it has been stopped by the stop-on-stall feature.
it_it: Reset Stall: con alcuni moduli è necessario cliccare su questo pulsante per poter riavviare il motore dopo che è stato arrestato dalla funzione di stop-on-stall.

source: Resettable fuse, ESD protection
it_it: Fusibile resettabile, protezione ESD

source: Resolution
it_it: Risoluzione

source: Resource
it_it: Risorsa

source: Resources
it_it: Risorse

source: Restart the COM port in the UCANV2.0.exe and press the Reset button of ESP32-S3-Touch-LCD-4.3 several times
it_it: Riavviare la porta COM in UCANV2.0.exe e premere più volte il pulsante Reset dell'ESP32-S3-Touch-LCD-4.3.

source: Restore all parameters: Writes the load signature to object 1011h sub-index 1 in order to restore all parameters to their default settings.
it_it: Restore all parameters: Scrive la firma di caricamento nell'oggetto 1011h sottoindice 1 per ripristinare tutti i parametri alle impostazioni di default.

source: Restore axis parameters: Writes the load signature to object 1011h sub-index 4 (or on multi-axis modules: 4 + axis_number) in order to restore just the parameters of the selected axis to their factory default settings.
it_it: Restore axis parameters: Scrive la firma di carico nell'oggetto 1011h sottoindice 4 (o nei moduli multiasse: 4 + numero_asse) per ripristinare solo i parametri dell'asse selezionato alle impostazioni di default di fabbrica.

source: Restore communication parameters: Writes the load signature to object 1011 h sub-index 2 in order to restore just the communication parameters to their default settings.
it_it: Restore communication parameters: Scrive la firma di caricamento nell'oggetto 1011 h sottoindice 2 per ripristinare solo i parametri di comunicazione alle impostazioni di default.

source: Restore device parameters: Writes the load signature to object 1011h sub-index 5 (or on multi-axis modules: 4 + number_of_motors) in order to restore just the device related parameters.
it_it: Restore device parameters: Scrive la firma di carico nell'oggetto 1011h sottoindice 5 (o nei moduli multiasse: 4 + numero_di_motori) per ripristinare solo i parametri relativi al dispositivo.

source: Result demonstration
it_it: Dimostrazione dei risultati

source: Result demonstration: ESP32-S3-Touch-LCD-4.3 will set the ADC resolution, read the current AD value, and print to the serial port terminal
it_it: Dimostrazione dei risultati: ESP32-S3-Touch-LCD-4.3 imposterà la risoluzione ADC, leggerà il valore AD corrente e stamperà sul terminale della porta seriale

source: Retrieved from "https://www.waveshare.com/w/index.php?title=Arduino_Board_Managers_Tutorial&oldid=94600"
it_it: Tratto da "https://www.waveshare.com/w/index.php?title=Arduino_Board_Managers_Tutorial&oldid=94600"

source: Retrieved from "https://www.waveshare.com/w/index.php?title=USB_TO_UART/I2C/SPI/JTAG&oldid=104382"
it_it: Pagina prelevata da "https://www.waveshare.com/w/index.php?title=USB_TO_UART/I2C/SPI/JTAG&oldid=104382"

source: Revision History
it_it: Cronologia delle Revisioni

source: Revision V4.6.0 | Document Revision V4.03 • 12/24
it_it: Revisione V4.6.0 | Revisione del Documento V4.03 • 12/24

source: Right-click on a colored box to change the display color of an item.
it_it: Click-destro del mouse su una casella colorata per modificare il colore di visualizzazione di un elemento.

source: Round downward
it_it: Arrotonda per difetto

source: Round upward
it_it: Arrotonda per eccesso

source: Run Current (SAP 6): the run current of the motor can also be set here.
it_it: Run Current (SAP 6): qui è possibile impostare anche la corrente di marcia del motore.

source: Run and flash Demo
it_it: Eseguire e flashare laDemo

source: Run the Arduino IDE and select File -> New Sketch
it_it: Eseguire l'IDE Arduino e selezionare File -> New Sketch

source: Run the First Arduino Demo
it_it: Eseguire la Prima Demo di Arduino

source: Run the First ESP-IDF Demo
it_it: Eseguire la prima demo di ESP-IDF

source: Run the installer and install all by default
it_it: Eseguire il programma di installazione e installare tutto per default

source: Run/Continue: After a program has been successfully assembled it can be executed.
it_it: Run/Continue: Dopo che un programma è stato assemblato correttamente, può essere eseguito.

source: SDO timeout: This is the timeout value for SDO communication.
it_it: SDO timeout: Questo è il valore di timeout per la comunicazione SDO.

source: SETV <index>, <bank>, <value>: Initializes the local variable specified by <index> and <bank> with the value specified by <value>.
it_it: SETV <index>, <bank>, <value>: Inizializza la variabile locale specificata da <index> e <bank> con il valore specificato da <value>.

source: SPI Debug OLED Screen Using Host Computer
it_it: Schermo OLED con Debug SPI Tramite Computer Host

source: SPI Drives OLED Screen In Python Environment
it_it: SPI Gestisce lo Schermo OLED in Ambiente Python

source: SPI Drives OLED Screen In Python IDLE
it_it: SPI Pilota lo schermo OLED in Python IDLE

source: SPI Interface Usage
it_it: Utilizzo dell'interfaccia SPI

source: SPI Interface Usage Demo
it_it: Demo di Utilizzo dell'Interfaccia SPI

source: SSCOM Serial port and network debugging assistant
it_it: Assistente per il debug di porte seriali e reti SSCOM

source: ST7262 Datasheet
it_it: Datasheet di ST7262

source: STM32 Microcontroller Debugging And Flashing On OpenOCD
it_it: Debug e Flashing del Microcontrollore STM32 su OpenOCD

source: STOA <index>, <bank>: stores the contents of the local accumulator to the local variable specified by <index> and <bank>.
it_it: STOA <index>, <bank>: memorizza il contenuto dell'accumulatore locale nella variabile locale specificata da <index> e <bank>.

source: STOX <index>, <bank>: stores the contents of the local X register to the local variable specified by <index> and <bank>.
it_it: STOX <index>, <bank>: memorizza il contenuto del registro X locale nella variabile locale specificata da <index> e <bank>.

source: Save all parameters: Writes the save signature to object 1010 h sub-index 1 in order to save all parameters.
it_it: Save all parameters: Scrive la firma di salvataggio nell'oggetto 1010 h sottoindice 1 per salvare tutti i parametri.

source: Save all: saves all files that are currently loaded in the editor and that have been changed.
it_it: Save all: salva tutti i file attualmente caricati nell'editor e che sono stati modificati.

source: Save as: saves the content of the current editor tab to a file using a new file name.
it_it: Save as: salva il contenuto della scheda dell'editor corrente in un file con un nuovo nome.

source: Save axis parameters: Writes the save signature to object 1010 h sub-index 4 (or on multi-axis modules: 4 + axis _number) in order to save just the parameters of the selected axis.
it_it: Save axis parameters: Scrive la firma di salvataggio nell'oggetto 1010 h sottoindice 4 (o nei moduli multiasse: 4 + numero_asse) per salvare solo i parametri dell'asse selezionato.

source: Save communication parameters: Writes the save signature to object 1010h sub-index 2 in order to save just the communication parameters.
it_it: Save communication parameters: Scrive la firma di salvataggio nell'oggetto 1010h sottoindice 2 per salvare solo i parametri di comunicazione.

source: Save current buffer: saves the currently displayed data to a CSV file.
it_it: Save current buffer: salva i dati attualmente visualizzati in un file CSV.

source: Save device parameters: Writes the save signature to object 1010h sub-index 5 (or on multi-axis modules: 4 + number_of_motors) in order to save just the device related parameters (configuration of general purpose I/O ports for example).
it_it: Save device parameters: Scrive la firma di salvataggio nell'oggetto 1010h sottoindice 5 (o nei moduli multiasse: 4 + numero_di_motori) per salvare solo i parametri relativi al dispositivo (ad esempio, la configurazione delle porte I/O per uso generico).

source: Save objects to NVM after download: All objects will be saved to non volatile memory after download (if the device supports this).
it_it: Save objects to NVM after download: Tutti gli oggetti verranno salvati nella memoria non volatile dopo il download (se il dispositivo lo supporta).

source: Save settings
it_it: Salvare le impostazioni

source: Save the project and select File -> Save As....
it_it: Salvare il progetto e selezionare File -> Save As....

source: Save: saves the content of the current editor tab to a file.
it_it: Save: salva il contenuto della scheda dell'editor corrente in un file.
